Revit 2025 API
CutLineType Enumeration
 The available line types for a stairs cut line.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CutLineType
Public Enumeration CutLineType
public enum class CutLineType
type CutLineType
Members
Member name | Value | Description
SingleLine | 0 |  Cutline type is single-line.
DoubleLine | 1 |  Cutline type is double-line.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace